In [18]:
import os
import pandas as pd

In [4]:
c=os.getcwd()
print(c)

C:\Users\Vikash Singh

In [19]:
titanic=pd.read_csv("TITANIC1.csv")

In [20]:
titanic.head()

,Passenger_id,Name,PClass,Age,Gender,Survived,GenderCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [21]:
titanic

,Passenger_id,Name,PClass,Age,Gender,Survived,GenderCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...,...
1308,1309,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,1310,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.00,male,0,0

In [9]:
print(titanic.dtypes)

Unnamed: 0      int64
Name           object
PClass         object
Age           float64
Gender         object
Survived        int64
GenderCode      int64
dtype: object

In [22]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Passenger_id  1313 non-null   int64
 1   Name          1313 non-null   object
 2   PClass        1313 non-null   object
 3   Age           756 non-null    float64
 4   Gender        1313 non-null   object
 5   Survived      1313 non-null   int64
 6   GenderCode    1313 non-null   int64
dtypes: float64(1), int64(3), object(3)
memory usage: 71.9+ KB
None

In [23]:
#printing column 
titanic.columns

Index(['Passenger_id', 'Name', 'PClass', 'Age', 'Gender', 'Survived',
       'GenderCode'],
      dtype='object')

In [24]:
titanic.columns[0]

'Passenger_id'

In [25]:
titanic.columns[3]

'Age'

In [26]:
print(titanic['Age'].head(16))

0     29.00
1      2.00
2     30.00
3     25.00
4      0.92
5     47.00
6     63.00
7     39.00
8     58.00
9     71.00
10    47.00
11    19.00
12      NaN
13      NaN
14      NaN
15    50.00
Name: Age, dtype: float64

In [31]:
#printing more than one columns together
print(titanic[["Age","Gender"]].head(8))

     Age  Gender
0  29.00  female
1   2.00  female
2  30.00    male
3  25.00  female
4   0.92    male
5  47.00    male
6  63.00  female
7  39.00    male

In [32]:
#printing passengers having age>30
age_30=titanic[titanic["Age"]>30]
print(age_30.head())

   Passenger_id                                          Name PClass   Age  \
5             6                            Anderson, Mr Harry    1st  47.0
6             7              Andrews, Miss Kornelia Theodosia    1st  63.0
7             8                        Andrews, Mr Thomas, jr    1st  39.0
8             9  Appleton, Mrs Edward Dale (Charlotte Lamson)    1st  58.0
9            10                        Artagaveytia, Mr Ramon    1st  71.0

   Gender  Survived  GenderCode
5    male         1           0
6  female         1           1
7    male         0           0
8  female         1           1
9    male         0           0

In [38]:
#printing  female whose age>30
age_30=titanic[(titanic["Gender"]=='female') & (titanic["Age"]>30)]
print(age_30.head())

    Passenger_id                                             Name PClass  \
6              7                 Andrews, Miss Kornelia Theodosia    1st
8              9     Appleton, Mrs Edward Dale (Charlotte Lamson)    1st
15            16   Baxter, Mrs James (Helene DeLaudeniere Chaput)    1st
19            20  Beckwith, Mrs Richard Leonard (Sallie Monypeny)    1st
28            29                          Bonnell, Miss Elizabeth    1st

     Age  Gender  Survived  GenderCode
6   63.0  female         1           1
8   58.0  female         1           1
15  50.0  female         1           1
19  47.0  female         1           1
28  58.0  female         1           1

In [39]:
#selecting the passengers with 1st and 2nd class
pclass_filter=titanic[titanic["PClass"].isin(["1st","2nd"])]
print(pclass_filter.tail(15))

     Passenger_id                              Name PClass   Age  Gender  \
587           588       West, Miss Constance Mirium    2nd   NaN  female
588           589              West, Mr Edwy Arthur    2nd  36.0    male
589           590  West, Mrs Edwy Arthur (Ada Mary)    2nd  33.0  female
590           591                Wheadon, Mr Edward    2nd   NaN    male
591           592                 Wheeler, Mr Edwin    2nd   NaN    male
592           593             Wheeler, Mr Frederick    2nd   NaN    male
593           594              Wilhelms, Mr Charles    2nd  32.0    male
594           595     Wilkinson, Mrs Elizabeth Anne    2nd   NaN  female
595           596       Williams, Mr Charles Eugene    2nd   NaN    male
596           597               Wright, Miss Marion    2nd  26.0  female
597           598             Yrois, Miss Henriette    2nd   NaN  female
598           599     Aldworth, Mr Charles Augustus    2nd  30.0    male
599           600               Brown, Miss Mildred    2nd  24.0  female
600           601                   Pernot, Mr Rene    2nd   NaN    male
601           602                  Swane, Mr George    2nd  18.0    male

     Survived  GenderCode
587         1           1
588         0           0
589         1           1
590         0           0
591         0           0
592         0           0
593         1           0
594         1           1
595         1           0
596         1           1
597         0           1
598         0           0
599         1           1
600         0           0
601         0           0

In [40]:
#Loc function
#selecting females with age>35
age_35=titanic.loc[(titanic["Age"]>35) & (titanic["Gender"]=="female"),["Name"]]
print(age_35.head())

                                               Name
6                  Andrews, Miss Kornelia Theodosia
8      Appleton, Mrs Edward Dale (Charlotte Lamson)
15   Baxter, Mrs James (Helene DeLaudeniere Chaput)
19  Beckwith, Mrs Richard Leonard (Sallie Monypeny)
28                          Bonnell, Miss Elizabeth

In [43]:
age_35=titanic.loc[(titanic["Age"]>35)& (titanic["Gender"]=="female"),["Name","PClass"]]
age_35.head()

                                               Name PClass
6                  Andrews, Miss Kornelia Theodosia    1st
8      Appleton, Mrs Edward Dale (Charlotte Lamson)    1st
15   Baxter, Mrs James (Helene DeLaudeniere Chaput)    1st
19  Beckwith, Mrs Richard Leonard (Sallie Monypeny)    1st
28                          Bonnell, Miss Elizabeth    1st

In [44]:
age_35.count()

Name      96
PClass    96
dtype: int64

In [45]:
#selecting a range of rows from 2 to 5
rows=titanic.loc[2:5]
rows

,Passenger_id,Name,PClass,Age,Gender,Survived,GenderCode
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,6,"Anderson, Mr Harry",1st,47.00,male,1,0

In [51]:
#updating the value of Pclass of people having age>60 with "Elderly" value
update_value=titanic.loc[(titanic["Age"]>60) ,["PClass"]]="Elderly"
print(titanic[titanic["Age"]>60])

      Passenger_id                                               Name  \
6                7                   Andrews, Miss Kornelia Theodosia
9               10                             Artagaveytia, Mr Ramon
67              68  Compton, Mrs Alexander Taylor (Mary Eliza Inge...
72              73                     Crosby, Captain Edward Gifford
73              74  Crosby, Mrs Edward Gifford (Catherine Elizabet...
103            104                                   Fortune, Mr Mark
119            120                           Goldschmidt, Mr George B
179            180                           Millet, Mr Francis Davis
191            192                        Nicholson, Mr Arthur Ernest
193            194                      Ostby, Mr Engelhart Cornelius
218            219                          Ryerson, Mr Arthur Larned
246            247                           Stead, Mr William Thomas
251            252                Stone, Mrs George Nelson (Martha E)
252            253                                  Straus, Mr Isidor
253            254                      Straus, Mrs Isidor (Ida Blun)
254            255                               Sutton, Mr Frederick
268            269                            Van Derhoef, Mr Wyckoff
270            271                            Warren, Mr Frank Manley
505            506                         Mitchell, Mr Henry Michael
509            510                           Myles, Mr Thomas Francis
772            773                                    Dewan, Mr Frank
1264          1265                                Turkula, Mrs Hedvig

       PClass   Age  Gender  Survived  GenderCode
6     Elderly  63.0  female         1           1
9     Elderly  71.0    male         0           0
67    Elderly  64.0  female         1           1
72    Elderly  70.0    male         0           0
73    Elderly  69.0  female         1           1
103   Elderly  64.0    male         0           0
119   Elderly  71.0    male         0           0
179   Elderly  65.0    male         0           0
191   Elderly  64.0    male         0           0
193   Elderly  64.0    male         0           0
218   Elderly  61.0    male         0           0
246   Elderly  62.0    male         0           0
251   Elderly  62.0  female         1           1
252   Elderly  67.0    male         0           0
253   Elderly  63.0  female         0           1
254   Elderly  61.0    male         0           0
268   Elderly  61.0    male         0           0
270   Elderly  64.0    male         0           0
505   Elderly  71.0    male         0           0
509   Elderly  64.0    male         0           0
772   Elderly  65.0    male         0           0
1264  Elderly  63.0  female         1           1

In [54]:
#using iloc function
#selecting rows using integer slices
rows2=titanic.iloc[5:10,3:6]
print(rows2)
r1=titanic.iloc[13:16,5]  #selecting 13 to 15 rows in col 5
print(r1)

    Age  Gender  Survived
5  47.0    male         1
6  63.0  female         1
7  39.0    male         0
8  58.0  female         1
9  71.0    male         0

In [56]:
#find out mean AGE
mean_age=titanic["Age"].mean()
print(mean_age)
print(round(mean_age,2))

30.397989417989418
30.4

In [60]:
#deleting Na values from age columns
clean_age=titanic["Age"].dropna() #dropna will remove the null value
print(clean_age.count())
print(clean_age.mean())

756
30.397989417989418